# Terraform environment tt02
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
module.key_vault.data.azurerm_client_config.current: Reading...
module.postgres_server.data.azurerm_client_config.current: Reading...
module.key_vault.data.azurerm_log_analytics_workspace.log_dwh: Reading...
data.azurerm_subnet.postgres: Reading...
module.rbac_platform_app["0ba88429-f3ff-4079-ba46-a3d3eeb82f9c"].data.azurerm_resource_group.spoke: Reading...
data.azurerm_subnet.default: Reading...
module.rbac_platform_app["e64ffd29-ca41-4b8c-84dc-a71cff5424c1"].data.azurerm_resource_group.spoke: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTE5ZGQ3ZjUxLWIzZjAtNDVkMS1hNDkyLTFmOTc2MzEzOWU1NTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTE5ZGQ3ZjUxLWIzZjAtNDVkMS1hNDkyLTFmOTc2MzEzOWU1NTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.postgres_server.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTE5ZGQ3ZjUxLWIzZjAtNDVkMS1hNDkyLTFmOTc2MzEzOWU1NTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_user_assigned_identity.admin: Reading...
module.rbac.data.azurerm_resource_group.spoke: Reading...
module.rbac_platform_app["e64ffd29-ca41-4b8c-84dc-a71cff5424c1"].data.azurerm_client_config.hub: Reading...
module.rbac_platform_app["e64ffd29-ca41-4b8c-84dc-a71cff5424c1"].data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac_platform_app["0ba88429-f3ff-4079-ba46-a3d3eeb82f9c"].data.azurerm_client_config.hub: Reading...
module.rbac_platform_app["0ba88429-f3ff-4079-ba46-a3d3eeb82f9c"].data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac.data.azurerm_resource_group.hub: Reading...
module.rbac_platform_app["e64ffd29-ca41-4b8c-84dc-a71cff5424c1"].data.azurerm_resource_group.spoke: Read complete after 0s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02]
module.rbac_platform_app["e64ffd29-ca41-4b8c-84dc-a71cff5424c1"].data.azurerm_resource_group.hub: Reading...
module.rbac.data.azurerm_resource_group.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.rbac_platform_app["0ba88429-f3ff-4079-ba46-a3d3eeb82f9c"].data.azurerm_resource_group.hub: Reading...
data.azurerm_subnet.postgres: Read complete after 1s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.Network/virtualNetworks/vnetssaltinnauth001tt02/subnets/Postgres]
module.appsettings.data.azurerm_resource_group.hub: Reading...
module.appsettings.data.azurerm_client_config.hub: Reading...
module.appsettings.data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac.data.azurerm_client_config.hub: Reading...
module.rbac.data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_private_dns_zone.postgres: Reading...
data.azurerm_user_assigned_identity.admin: Read complete after 1s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mipgsqladminaltinnauth001tt02]
module.postgres_server.data.azurerm_virtual_network.hub: Reading...
module.rbac_platform_app["e64ffd29-ca41-4b8c-84dc-a71cff5424c1"].data.azurerm_resource_group.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.key_vault.data.azurerm_private_dns_zone.key_vault: Reading...
module.rbac_platform_app["0ba88429-f3ff-4079-ba46-a3d3eeb82f9c"].data.azurerm_resource_group.spoke: Read complete after 2s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02]
data.azurerm_subnet.default: Read complete after 2s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.Network/virtualNetworks/vnetdsaltinnauth001tt02/subnets/Default]
module.key_vault.data.azurerm_private_dns_zone.key_vault: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net]
module.rbac_platform_app["0ba88429-f3ff-4079-ba46-a3d3eeb82f9c"].data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.rbac_platform_app["e64ffd29-ca41-4b8c-84dc-a71cff5424c1"].data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
data.azurerm_private_dns_zone.postgres: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com]
module.postgres_server.data.azurerm_virtual_network.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/virtualNetworks/vnetaltinnauth001hub]
module.rbac_platform_app["0ba88429-f3ff-4079-ba46-a3d3eeb82f9c"].data.azurerm_resource_group.hub: Read complete after 2s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.key_vault.data.azurerm_resource_group.key_vault: Reading...
module.appsettings.data.azurerm_resource_group.hub: Read complete after 2s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.key_vault.data.azurerm_resource_group.key_vault: Read complete after 0s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauthregister001tt02]
module.key_vault.data.azurerm_log_analytics_workspace.log_dwh: Read complete after 3s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.OperationalInsights/workspaces/logdwhaltinnauth001tt02]
module.rbac.data.azurerm_resource_group.spoke: Read complete after 4s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02]
module.rbac.data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.rbac_platform_app["0ba88429-f3ff-4079-ba46-a3d3eeb82f9c"].data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 2s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001tt02]
module.rbac_platform_app["e64ffd29-ca41-4b8c-84dc-a71cff5424c1"].data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 2s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001tt02]
module.rbac.data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 2s [id=/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauth001tt02/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001tt02]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_key_vault_secret.postgres_app will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "postgres_app" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauthregister001tt02/providers/Microsoft.KeyVault/vaults/kvregaltinnauth001tt02"
      + name                    = "db-psqlsrvaltinnauthregister001tt02-register-app"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.postgres_migration will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "postgres_migration" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauthregister001tt02/providers/Microsoft.KeyVault/vaults/kvregaltinnauth001tt02"
      + name                    = "db-psqlsrvaltinnauthregister001tt02-register-migrator"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # null_resource.bootstrap_database must be replaced
-/+ resource "null_resource" "bootstrap_database" {
      ~ id       = "6063606473867118839" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "ts" = "2025-05-27T07:29:49Z" -> (known after apply)
        }
    }

  # module.appsettings.azurerm_app_configuration_key.labels_vault_references["tt02-register|Altinn:Npgsql:register:ConnectionString"] will be updated in-place
  ~ resource "azurerm_app_configuration_key" "labels_vault_references" {
        id                     = "https://appconfaltinnauth001hub.azconfig.io/kv/Altinn:Npgsql:register:ConnectionString?label=tt02-register"
        tags                   = {}
      ~ vault_key_reference    = "https://kvregaltinnauth001tt02.vault.azure.net/secrets/db-psqlsrvaltinnauthregister001tt02-register-app" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.appsettings.azurerm_app_configuration_key.labels_vault_references["tt02-register|Altinn:Npgsql:register:Migrate:ConnectionString"] will be updated in-place
  ~ resource "azurerm_app_configuration_key" "labels_vault_references" {
        id                     = "https://appconfaltinnauth001hub.azconfig.io/kv/Altinn:Npgsql:register:Migrate:ConnectionString?label=tt02-register"
        tags                   = {}
      ~ vault_key_reference    = "https://kvregaltinnauth001tt02.vault.azure.net/secrets/db-psqlsrvaltinnauthregister001tt02-register-migrator" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.postgres_server.azurerm_postgresql_flexible_server.postgres_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "postgres_server" {
      ~ administrator_password            = (sensitive value)
        id                                = "/subscriptions/19dd7f51-b3f0-45d1-a492-1f9763139e55/resourceGroups/rgaltinnauthregister001tt02/providers/Microsoft.DBforPostgreSQL/flexibleServers/psqlsrvaltinnauthregister001tt02"
        name                              = "psqlsrvaltinnauthregister001tt02"
        tags                              = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.postgres_server.random_password.pass must be replaced
-/+ resource "random_password" "pass" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "trigger" = "2025-05-27T07:28:39Z" -> (known after apply)
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 2 to add, 3 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @andreasisnes |
| Action | `push` |
| Working Directory | `src/apps/Altinn.Register/infra` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/tt02/altinn.register.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_tt02_altinn.register.tfstate.tfplan`